virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/pdmic.h
/* -------- PDMIC_IMR : (PDMIC Offset: 0x20) ( R/ 32) Interrupt Mask Register -------- */
#define PDMIC_IMR_DRDY_Pos                    _U_(24)                                              /**< (PDMIC_IMR) Data Ready Interrupt Mask Position */
#define PDMIC_IMR_DRDY_Msk                    (_U_(0x1) << PDMIC_IMR_DRDY_Pos)                     /**< (PDMIC_IMR) Data Ready Interrupt Mask Mask */
#define PDMIC_IMR_DRDY(value)                 (PDMIC_IMR_DRDY_Msk & ((value) << PDMIC_IMR_DRDY_Pos))
#define PDMIC_IMR_OVRE_Pos                    _U_(25)                                              /**< (PDMIC_IMR) General Overrun Error Interrupt Mask Position */
#define PDMIC_IMR_OVRE_Msk                    (_U_(0x1) << PDMIC_IMR_OVRE_Pos)                     /**< (PDMIC_IMR) General Overrun Error Interrupt Mask Mask */
#define PDMIC_IMR_OVRE(value)                 (PDMIC_IMR_OVRE_Msk & ((value) << PDMIC_IMR_OVRE_Pos))
#define PDMIC_IMR_ENDRX_Pos                   _U_(27)                                              /**< (PDMIC_IMR) End of Receive Buffer Interrupt Mask Position */
#define PDMIC_IMR_ENDRX_Msk                   (_U_(0x1) << PDMIC_IMR_ENDRX_Pos)                    /**< (PDMIC_IMR) End of Receive Buffer Interrupt Mask Mask */
#define PDMIC_IMR_ENDRX(value)                (PDMIC_IMR_ENDRX_Msk & ((value) << PDMIC_IMR_ENDRX_Pos))
#define PDMIC_IMR_RXBUFF_Pos                  _U_(28)                                              /**< (PDMIC_IMR) Receive Buffer Full Interrupt Mask Position */
#define PDMIC_IMR_RXBUFF_Msk                  (_U_(0x1) << PDMIC_IMR_RXBUFF_Pos)                   /**< (PDMIC_IMR) Receive Buffer Full Interrupt Mask Mask */
#define PDMIC_IMR_RXBUFF(value)               (PDMIC_IMR_RXBUFF_Msk & ((value) << PDMIC_IMR_RXBUFF_Pos))
#define PDMIC_IMR_Msk                         _U_(0x1B000000)                                      /**< (PDMIC_IMR) Register Mask  */


/* -------- PDMIC_ISR : (PDMIC Offset: 0x24) ( R/ 32) Interrupt Status Register -------- */
#define PDMIC_ISR_FIFOCNT_Pos                 _U_(16)                                              /**< (PDMIC_ISR) FIFO Count Position */
#define PDMIC_ISR_FIFOCNT_Msk                 (_U_(0xFF) << PDMIC_ISR_FIFOCNT_Pos)                 /**< (PDMIC_ISR) FIFO Count Mask */
#define PDMIC_ISR_FIFOCNT(value)              (PDMIC_ISR_FIFOCNT_Msk & ((value) << PDMIC_ISR_FIFOCNT_Pos))
#define PDMIC_ISR_DRDY_Pos                    _U_(24)                                              /**< (PDMIC_ISR) Data Ready Position */
#define PDMIC_ISR_DRDY_Msk                    (_U_(0x1) << PDMIC_ISR_DRDY_Pos)                     /**< (PDMIC_ISR) Data Ready Mask */
#define PDMIC_ISR_DRDY(value)                 (PDMIC_ISR_DRDY_Msk & ((value) << PDMIC_ISR_DRDY_Pos))
#define PDMIC_ISR_OVRE_Pos                    _U_(25)                                              /**< (PDMIC_ISR) Overrun Error Position */
#define PDMIC_ISR_OVRE_Msk                    (_U_(0x1) << PDMIC_ISR_OVRE_Pos)                     /**< (PDMIC_ISR) Overrun Error Mask */
#define PDMIC_ISR_OVRE(value)                 (PDMIC_ISR_OVRE_Msk & ((value) << PDMIC_ISR_OVRE_Pos))
#define PDMIC_ISR_ENDRX_Pos                   _U_(27)                                              /**< (PDMIC_ISR) End of RX Buffer Position */
#define PDMIC_ISR_ENDRX_Msk                   (_U_(0x1) << PDMIC_ISR_ENDRX_Pos)                    /**< (PDMIC_ISR) End of RX Buffer Mask */
#define PDMIC_ISR_ENDRX(value)                (PDMIC_ISR_ENDRX_Msk & ((value) << PDMIC_ISR_ENDRX_Pos))
#define PDMIC_ISR_RXBUFF_Pos                  _U_(28)                                              /**< (PDMIC_ISR) RX Buffer Full Position */
#define PDMIC_ISR_RXBUFF_Msk                  (_U_(0x1) << PDMIC_ISR_RXBUFF_Pos)                   /**< (PDMIC_ISR) RX Buffer Full Mask */
#define PDMIC_ISR_RXBUFF(value)               (PDMIC_ISR_RXBUFF_Msk & ((value) << PDMIC_ISR_RXBUFF_Pos))
#define PDMIC_ISR_Msk                         _U_(0x1BFF0000)                                      /**< (PDMIC_ISR) Register Mask  */


/* -------- PDMIC_DSPR0 : (PDMIC Offset: 0x58) (R/W 32) DSP Configuration Register 0 -------- */
#define PDMIC_DSPR0_HPFBYP_Pos                _U_(1)                                               /**< (PDMIC_DSPR0) High-Pass Filter Bypass Position */
#define PDMIC_DSPR0_HPFBYP_Msk                (_U_(0x1) << PDMIC_DSPR0_HPFBYP_Pos)                 /**< (PDMIC_DSPR0) High-Pass Filter Bypass Mask */
#define PDMIC_DSPR0_HPFBYP(value)             (PDMIC_DSPR0_HPFBYP_Msk & ((value) << PDMIC_DSPR0_HPFBYP_Pos))
#define PDMIC_DSPR0_SINBYP_Pos                _U_(2)                                               /**< (PDMIC_DSPR0) SINCC Filter Bypass Position */
#define PDMIC_DSPR0_SINBYP_Msk                (_U_(0x1) << PDMIC_DSPR0_SINBYP_Pos)                 /**< (PDMIC_DSPR0) SINCC Filter Bypass Mask */
#define PDMIC_DSPR0_SINBYP(value)             (PDMIC_DSPR0_SINBYP_Msk & ((value) << PDMIC_DSPR0_SINBYP_Pos))
#define PDMIC_DSPR0_SIZE_Pos                  _U_(3)                                               /**< (PDMIC_DSPR0) Data Size Position */
#define PDMIC_DSPR0_SIZE_Msk                  (_U_(0x1) << PDMIC_DSPR0_SIZE_Pos)                   /**< (PDMIC_DSPR0) Data Size Mask */
#define PDMIC_DSPR0_SIZE(value)               (PDMIC_DSPR0_SIZE_Msk & ((value) << PDMIC_DSPR0_SIZE_Pos))
#define PDMIC_DSPR0_OSR_Pos                   _U_(4)                                               /**< (PDMIC_DSPR0) Oversampling Ratio Position */
#define PDMIC_DSPR0_OSR_Msk                   (_U_(0x7) << PDMIC_DSPR0_OSR_Pos)                    /**< (PDMIC_DSPR0) Oversampling Ratio Mask */
#define PDMIC_DSPR0_OSR(value)                (PDMIC_DSPR0_OSR_Msk & ((value) << PDMIC_DSPR0_OSR_Pos))
#define   PDMIC_DSPR0_OSR_128_Val             _U_(0x0)                                             /**< (PDMIC_DSPR0) Oversampling ratio is 128  */
#define   PDMIC_DSPR0_OSR_64_Val              _U_(0x1)                                             /**< (PDMIC_DSPR0) Oversampling ratio is 64  */
#define PDMIC_DSPR0_OSR_128                   (PDMIC_DSPR0_OSR_128_Val << PDMIC_DSPR0_OSR_Pos)     /**< (PDMIC_DSPR0) Oversampling ratio is 128 Position  */
#define PDMIC_DSPR0_OSR_64                    (PDMIC_DSPR0_OSR_64_Val << PDMIC_DSPR0_OSR_Pos)      /**< (PDMIC_DSPR0) Oversampling ratio is 64 Position  */
#define PDMIC_DSPR0_SCALE_Pos                 _U_(8)                                               /**< (PDMIC_DSPR0) Data Scale Position */
#define PDMIC_DSPR0_SCALE_Msk                 (_U_(0xF) << PDMIC_DSPR0_SCALE_Pos)                  /**< (PDMIC_DSPR0) Data Scale Mask */
#define PDMIC_DSPR0_SCALE(value)              (PDMIC_DSPR0_SCALE_Msk & ((value) << PDMIC_DSPR0_SCALE_Pos))
#define PDMIC_DSPR0_SHIFT_Pos                 _U_(12)                                              /**< (PDMIC_DSPR0) Data Shift Position */
#define PDMIC_DSPR0_SHIFT_Msk                 (_U_(0xF) << PDMIC_DSPR0_SHIFT_Pos)                  /**< (PDMIC_DSPR0) Data Shift Mask */
#define PDMIC_DSPR0_SHIFT(value)              (PDMIC_DSPR0_SHIFT_Msk & ((value) << PDMIC_DSPR0_SHIFT_Pos))
#define PDMIC_DSPR0_Msk                       _U_(0x0000FF7E)                                      /**< (PDMIC_DSPR0) Register Mask  */


/* -------- PDMIC_DSPR1 : (PDMIC Offset: 0x5C) (R/W 32) DSP Configuration Register 1 -------- */
#define PDMIC_DSPR1_DGAIN_Pos                 _U_(0)                                               /**< (PDMIC_DSPR1) Gain Correction Position */
#define PDMIC_DSPR1_DGAIN_Msk                 (_U_(0x7FFF) << PDMIC_DSPR1_DGAIN_Pos)               /**< (PDMIC_DSPR1) Gain Correction Mask */
#define PDMIC_DSPR1_DGAIN(value)              (PDMIC_DSPR1_DGAIN_Msk & ((value) << PDMIC_DSPR1_DGAIN_Pos))
#define PDMIC_DSPR1_OFST_Pos                  _U_(16)                                              /**< (PDMIC_DSPR1) Offset Correction Position */
#define PDMIC_DSPR1_OFST_Msk                  (_U_(0xFFFF) << PDMIC_DSPR1_OFST_Pos)                /**< (PDMIC_DSPR1) Offset Correction Mask */
#define PDMIC_DSPR1_OFST(value)               (PDMIC_DSPR1_OFST_Msk & ((value) << PDMIC_DSPR1_OFST_Pos))
#define PDMIC_DSPR1_Msk                       _U_(0xFFFF7FFF)                                      /**< (PDMIC_DSPR1) Register Mask  */


/* -------- PDMIC_WPMR : (PDMIC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define PDMIC_WPMR_WPEN_Pos                   _U_(0)                                               /**< (PDMIC_WPMR) Write Protection Enable Position */
#define PDMIC_WPMR_WPEN_Msk                   (_U_(0x1) << PDMIC_WPMR_WPEN_Pos)                    /**< (PDMIC_WPMR) Write Protection Enable Mask */
#define PDMIC_WPMR_WPEN(value)                (PDMIC_WPMR_WPEN_Msk & ((value) << PDMIC_WPMR_WPEN_Pos))
#define PDMIC_WPMR_WPKEY_Pos                  _U_(8)                                               /**< (PDMIC_WPMR) Write Protect Key Position */
#define PDMIC_WPMR_WPKEY_Msk                  (_U_(0xFFFFFF) << PDMIC_WPMR_WPKEY_Pos)              /**< (PDMIC_WPMR) Write Protect Key Mask */
#define PDMIC_WPMR_WPKEY(value)               (PDMIC_WPMR_WPKEY_Msk & ((value) << PDMIC_WPMR_WPKEY_Pos))
#define   PDMIC_WPMR_WPKEY_PASSWD_Val         _U_(0x414443)                                        /**< (PDMIC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define PDMIC_WPMR_WPKEY_PASSWD               (PDMIC_WPMR_WPKEY_PASSWD_Val << PDMIC_WPMR_WPKEY_Pos) /**< (PDMIC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define PDMIC_WPMR_Msk                        _U_(0xFFFFFF01)                                      /**< (PDMIC_WPMR) Register Mask  */


/* -------- PDMIC_WPSR : (PDMIC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define PDMIC_WPSR_WPVS_Pos                   _U_(0)                                               /**< (PDMIC_WPSR) Write Protection Violation Status Position */
#define PDMIC_WPSR_WPVS_Msk                   (_U_(0x1) << PDMIC_WPSR_WPVS_Pos)                    /**< (PDMIC_WPSR) Write Protection Violation Status Mask */
#define PDMIC_WPSR_WPVS(value)                (PDMIC_WPSR_WPVS_Msk & ((value) << PDMIC_WPSR_WPVS_Pos))
#define PDMIC_WPSR_WPVSRC_Pos                 _U_(8)                                               /**< (PDMIC_WPSR) Write Protection Violation Source Position */
#define PDMIC_WPSR_WPVSRC_Msk                 (_U_(0xFFFF) << PDMIC_WPSR_WPVSRC_Pos)               /**< (PDMIC_WPSR) Write Protection Violation Source Mask */
#define PDMIC_WPSR_WPVSRC(value)              (PDMIC_WPSR_WPVSRC_Msk & ((value) << PDMIC_WPSR_WPVSRC_Pos))
#define PDMIC_WPSR_Msk                        _U_(0x00FFFF01)                                      /**< (PDMIC_WPSR) Register Mask  */


/* -------- PDMIC_RPR : (PDMIC Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define PDMIC_RPR_RXPTR_Pos                   _U_(0)                                               /**< (PDMIC_RPR) Receive Pointer Register Position */
#define PDMIC_RPR_RXPTR_Msk                   (_U_(0xFFFFFFFF) << PDMIC_RPR_RXPTR_Pos)             /**< (PDMIC_RPR) Receive Pointer Register Mask */
#define PDMIC_RPR_RXPTR(value)                (PDMIC_RPR_RXPTR_Msk & ((value) << PDMIC_RPR_RXPTR_Pos))
#define PDMIC_RPR_Msk                         _U_(0xFFFFFFFF)                                      /**< (PDMIC_RPR) Register Mask  */


/* -------- PDMIC_RCR : (PDMIC Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define PDMIC_RCR_RXCTR_Pos                   _U_(0)                                               /**< (PDMIC_RCR) Receive Counter Register Position */
#define PDMIC_RCR_RXCTR_Msk                   (_U_(0xFFFF) << PDMIC_RCR_RXCTR_Pos)                 /**< (PDMIC_RCR) Receive Counter Register Mask */
#define PDMIC_RCR_RXCTR(value)                (PDMIC_RCR_RXCTR_Msk & ((value) << PDMIC_RCR_RXCTR_Pos))
#define PDMIC_RCR_Msk                         _U_(0x0000FFFF)                                      /**< (PDMIC_RCR) Register Mask  */


/* -------- PDMIC_RNPR : (PDMIC Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define PDMIC_RNPR_RXNPTR_Pos                 _U_(0)                                               /**< (PDMIC_RNPR) Receive Next Pointer Position */
#define PDMIC_RNPR_RXNPTR_Msk                 (_U_(0xFFFFFFFF) << PDMIC_RNPR_RXNPTR_Pos)           /**< (PDMIC_RNPR) Receive Next Pointer Mask */
#define PDMIC_RNPR_RXNPTR(value)              (PDMIC_RNPR_RXNPTR_Msk & ((value) << PDMIC_RNPR_RXNPTR_Pos))
#define PDMIC_RNPR_Msk                        _U_(0xFFFFFFFF)                                      /**< (PDMIC_RNPR) Register Mask  */


/* -------- PDMIC_RNCR : (PDMIC Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define PDMIC_RNCR_RXNCTR_Pos                 _U_(0)                                               /**< (PDMIC_RNCR) Receive Next Counter Position */
#define PDMIC_RNCR_RXNCTR_Msk                 (_U_(0xFFFF) << PDMIC_RNCR_RXNCTR_Pos)               /**< (PDMIC_RNCR) Receive Next Counter Mask */
#define PDMIC_RNCR_RXNCTR(value)              (PDMIC_RNCR_RXNCTR_Msk & ((value) << PDMIC_RNCR_RXNCTR_Pos))
#define PDMIC_RNCR_Msk                        _U_(0x0000FFFF)                                      /**< (PDMIC_RNCR) Register Mask  */


/* -------- PDMIC_PTCR : (PDMIC Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define PDMIC_PTCR_RXTEN_Pos                  _U_(0)                                               /**< (PDMIC_PTCR) Receiver Transfer Enable Position */
#define PDMIC_PTCR_RXTEN_Msk                  (_U_(0x1) << PDMIC_PTCR_RXTEN_Pos)                   /**< (PDMIC_PTCR) Receiver Transfer Enable Mask */
#define PDMIC_PTCR_RXTEN(value)               (PDMIC_PTCR_RXTEN_Msk & ((value) << PDMIC_PTCR_RXTEN_Pos))
#define PDMIC_PTCR_RXTDIS_Pos                 _U_(1)                                               /**< (PDMIC_PTCR) Receiver Transfer Disable Position */
#define PDMIC_PTCR_RXTDIS_Msk                 (_U_(0x1) << PDMIC_PTCR_RXTDIS_Pos)                  /**< (PDMIC_PTCR) Receiver Transfer Disable Mask */
#define PDMIC_PTCR_RXTDIS(value)              (PDMIC_PTCR_RXTDIS_Msk & ((value) << PDMIC_PTCR_RXTDIS_Pos))
#define PDMIC_PTCR_TXTEN_Pos                  _U_(8)                                               /**< (PDMIC_PTCR) Transmitter Transfer Enable Position */
#define PDMIC_PTCR_TXTEN_Msk                  (_U_(0x1) << PDMIC_PTCR_TXTEN_Pos)                   /**< (PDMIC_PTCR) Transmitter Transfer Enable Mask */
#define PDMIC_PTCR_TXTEN(value)               (PDMIC_PTCR_TXTEN_Msk & ((value) << PDMIC_PTCR_TXTEN_Pos))
#define PDMIC_PTCR_TXTDIS_Pos                 _U_(9)                                               /**< (PDMIC_PTCR) Transmitter Transfer Disable Position */
#define PDMIC_PTCR_TXTDIS_Msk                 (_U_(0x1) << PDMIC_PTCR_TXTDIS_Pos)                  /**< (PDMIC_PTCR) Transmitter Transfer Disable Mask */
#define PDMIC_PTCR_TXTDIS(value)              (PDMIC_PTCR_TXTDIS_Msk & ((value) << PDMIC_PTCR_TXTDIS_Pos))
#define PDMIC_PTCR_RXCBEN_Pos                 _U_(16)                                              /**< (PDMIC_PTCR) Receiver Circular Buffer Enable Position */
#define PDMIC_PTCR_RXCBEN_Msk                 (_U_(0x1) << PDMIC_PTCR_RXCBEN_Pos)                  /**< (PDMIC_PTCR) Receiver Circular Buffer Enable Mask */
#define PDMIC_PTCR_RXCBEN(value)              (PDMIC_PTCR_RXCBEN_Msk & ((value) << PDMIC_PTCR_RXCBEN_Pos))
#define PDMIC_PTCR_RXCBDIS_Pos                _U_(17)                                              /**< (PDMIC_PTCR) Receiver Circular Buffer Disable Position */
#define PDMIC_PTCR_RXCBDIS_Msk                (_U_(0x1) << PDMIC_PTCR_RXCBDIS_Pos)                 /**< (PDMIC_PTCR) Receiver Circular Buffer Disable Mask */
#define PDMIC_PTCR_RXCBDIS(value)             (PDMIC_PTCR_RXCBDIS_Msk & ((value) << PDMIC_PTCR_RXCBDIS_Pos))
#define PDMIC_PTCR_TXCBEN_Pos                 _U_(18)                                              /**< (PDMIC_PTCR) Transmitter Circular Buffer Enable Position */
#define PDMIC_PTCR_TXCBEN_Msk                 (_U_(0x1) << PDMIC_PTCR_TXCBEN_Pos)                  /**< (PDMIC_PTCR) Transmitter Circular Buffer Enable Mask */
#define PDMIC_PTCR_TXCBEN(value)              (PDMIC_PTCR_TXCBEN_Msk & ((value) << PDMIC_PTCR_TXCBEN_Pos))
#define PDMIC_PTCR_TXCBDIS_Pos                _U_(19)                                              /**< (PDMIC_PTCR) Transmitter Circular Buffer Disable Position */
#define PDMIC_PTCR_TXCBDIS_Msk                (_U_(0x1) << PDMIC_PTCR_TXCBDIS_Pos)                 /**< (PDMIC_PTCR) Transmitter Circular Buffer Disable Mask */
#define PDMIC_PTCR_TXCBDIS(value)             (PDMIC_PTCR_TXCBDIS_Msk & ((value) << PDMIC_PTCR_TXCBDIS_Pos))
#define PDMIC_PTCR_ERRCLR_Pos                 _U_(24)                                              /**< (PDMIC_PTCR) Transfer Bus Error Clear Position */
#define PDMIC_PTCR_ERRCLR_Msk                 (_U_(0x1) << PDMIC_PTCR_ERRCLR_Pos)                  /**< (PDMIC_PTCR) Transfer Bus Error Clear Mask */
#define PDMIC_PTCR_ERRCLR(value)              (PDMIC_PTCR_ERRCLR_Msk & ((value) << PDMIC_PTCR_ERRCLR_Pos))
#define PDMIC_PTCR_Msk                        _U_(0x010F0303)                                      /**< (PDMIC_PTCR) Register Mask  */


/* -------- PDMIC_PTSR : (PDMIC Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define PDMIC_PTSR_RXTEN_Pos                  _U_(0)                                               /**< (PDMIC_PTSR) Receiver Transfer Enable Position */
#define PDMIC_PTSR_RXTEN_Msk                  (_U_(0x1) << PDMIC_PTSR_RXTEN_Pos)                   /**< (PDMIC_PTSR) Receiver Transfer Enable Mask */
#define PDMIC_PTSR_RXTEN(value)               (PDMIC_PTSR_RXTEN_Msk & ((value) << PDMIC_PTSR_RXTEN_Pos))
#define PDMIC_PTSR_TXTEN_Pos                  _U_(8)                                               /**< (PDMIC_PTSR) Transmitter Transfer Enable Position */
#define PDMIC_PTSR_TXTEN_Msk                  (_U_(0x1) << PDMIC_PTSR_TXTEN_Pos)                   /**< (PDMIC_PTSR) Transmitter Transfer Enable Mask */
#define PDMIC_PTSR_TXTEN(value)               (PDMIC_PTSR_TXTEN_Msk & ((value) << PDMIC_PTSR_TXTEN_Pos))
#define PDMIC_PTSR_RXCBEN_Pos                 _U_(16)                                              /**< (PDMIC_PTSR) Receiver Circular Buffer Enable Position */
#define PDMIC_PTSR_RXCBEN_Msk                 (_U_(0x1) << PDMIC_PTSR_RXCBEN_Pos)                  /**< (PDMIC_PTSR) Receiver Circular Buffer Enable Mask */
#define PDMIC_PTSR_RXCBEN(value)              (PDMIC_PTSR_RXCBEN_Msk & ((value) << PDMIC_PTSR_RXCBEN_Pos))
#define PDMIC_PTSR_TXCBEN_Pos                 _U_(18)                                              /**< (PDMIC_PTSR) Transmitter Circular Buffer Enable Position */
#define PDMIC_PTSR_TXCBEN_Msk                 (_U_(0x1) << PDMIC_PTSR_TXCBEN_Pos)                  /**< (PDMIC_PTSR) Transmitter Circular Buffer Enable Mask */
#define PDMIC_PTSR_TXCBEN(value)              (PDMIC_PTSR_TXCBEN_Msk & ((value) << PDMIC_PTSR_TXCBEN_Pos))
#define PDMIC_PTSR_ERR_Pos                    _U_(24)                                              /**< (PDMIC_PTSR) Transfer Bus Error Position */
#define PDMIC_PTSR_ERR_Msk                    (_U_(0x1) << PDMIC_PTSR_ERR_Pos)                     /**< (PDMIC_PTSR) Transfer Bus Error Mask */
#define PDMIC_PTSR_ERR(value)                 (PDMIC_PTSR_ERR_Msk & ((value) << PDMIC_PTSR_ERR_Pos))
#define PDMIC_PTSR_Msk                        _U_(0x01050101)                                      /**< (PDMIC_PTSR) Register Mask  */


/** \brief PDMIC register offsets definitions */
#define PDMIC_CR_REG_OFST              (0x00)              /**< (PDMIC_CR) Control Register Offset */
#define PDMIC_MR_REG_OFST              (0x04)              /**< (PDMIC_MR) Mode Register Offset */
#define PDMIC_CDR_REG_OFST             (0x14)              /**< (PDMIC_CDR) Converted Data Register Offset */
#define PDMIC_IER_REG_OFST             (0x18)              /**< (PDMIC_IER) Interrupt Enable Register Offset */
#define PDMIC_IDR_REG_OFST             (0x1C)              /**< (PDMIC_IDR) Interrupt Disable Register Offset */
#define PDMIC_IMR_REG_OFST             (0x20)              /**< (PDMIC_IMR) Interrupt Mask Register Offset */
#define PDMIC_ISR_REG_OFST             (0x24)              /**< (PDMIC_ISR) Interrupt Status Register Offset */
#define PDMIC_DSPR0_REG_OFST           (0x58)              /**< (PDMIC_DSPR0) DSP Configuration Register 0 Offset */
#define PDMIC_DSPR1_REG_OFST           (0x5C)              /**< (PDMIC_DSPR1) DSP Configuration Register 1 Offset */
#define PDMIC_WPMR_REG_OFST            (0xE4)              /**< (PDMIC_WPMR) Write Protection Mode Register Offset */
#define PDMIC_WPSR_REG_OFST            (0xE8)              /**< (PDMIC_WPSR) Write Protection Status Register Offset */
#define PDMIC_RPR_REG_OFST             (0x100)             /**< (PDMIC_RPR) Receive Pointer Register Offset */
#define PDMIC_RCR_REG_OFST             (0x104)             /**< (PDMIC_RCR) Receive Counter Register Offset */
#define PDMIC_RNPR_REG_OFST            (0x110)             /**< (PDMIC_RNPR) Receive Next Pointer Register Offset */
#define PDMIC_RNCR_REG_OFST            (0x114)             /**< (PDMIC_RNCR) Receive Next Counter Register Offset */
#define PDMIC_PTCR_REG_OFST            (0x120)             /**< (PDMIC_PTCR) Transfer Control Register Offset */
#define PDMIC_PTSR_REG_OFST            (0x124)             /**< (PDMIC_PTSR) Transfer Status Register Offset */

